src/toir_cf/src/DataProcessors/торо_КорректировкаППРПоРМ/торо_КорректировкаППРПоРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_КорректировкаППРПоРМ</name>
  <attributes>
    <name>ДатаНачалаЛимита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЛимита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланРемонтовКорректировка</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ГраничныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВероятностьВыходаИзСтроя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ущерб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РентабельностьРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Год</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/toir_cf/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>СрокПоНормативу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_ГодовыеЛимитыРемонтныхРабот/торо_ГодовыеЛимитыРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ГодовыеЛимитыРемонтныхРабот</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_ОценкаРМПлановыхРемонтов/торо_ОценкаРМПлановыхРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОценкаРМПлановыхРемонтов</name>
  <resources>
    <name>ВероятностьВыходаИзСтроя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ущерб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Enums/СпособыСтроительства/СпособыСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСтроительства</name>
  <enumValues>
    <name>Подрядный</name>
    <comment>С привлечением подрядных организаций</comment>
  </enumValues>
  <enumValues>
    <name>Хозспособ</name>
    <comment>Строительство собственными силами</comment>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>торо_НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>торо_НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_НаправленияОбъектовРемонтныхРабот/торо_НаправленияОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_НаправленияОбъектовРемонтныхРабот</name>
  <predefined>
    <items>
      <name>БезНаправления</name>
      <description>Без направления</description>
    </items>
  </predefined>
  <attributes>
    <name>НаборСвойствОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Составное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/DataProcessors/торо_КорректировкаППРПоРМ/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаНачалаЛимита") Тогда
		Объект.ДатаНачалаЛимита = Параметры.ДатаНачалаЛимита;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаОкончанияЛимита") Тогда
		Объект.ДатаОкончанияЛимита = Параметры.ДатаОкончанияЛимита;
	КонецЕсли;
	
	Если Параметры.Свойство("СтруктураПланаРемонтов") Тогда
		Для каждого Стр Из Параметры.СтруктураПланаРемонтов Цикл
			НС = Объект.ПланРемонтовКорректировка.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьОценкиРМ();
	
	Если Объект.ДатаНачалаЛимита <> Объект.ДатаОкончанияЛимита Тогда
		ДатаТек = Объект.ДатаНачалаЛимита;
		
		Пока ДатаТек <= Объект.ДатаОкончанияЛимита Цикл
			СписокГодов.Добавить(ДатаТек, Формат(ДатаТек, "ЧГ="));
			ДатаТек = ДатаТек + 1;
		КонецЦикла;
		
		ГодКорректировки = Формат(Объект.ДатаНачалаЛимита, "ЧГ=") + " - " + Формат(Объект.ДатаОкончанияЛимита, "ЧГ=");
		
		СписокГодов.Вставить(0,Формат(Объект.ДатаНачалаЛимита, "ЧГ=") + " - " + Формат(Объект.ДатаОкончанияЛимита, "ЧГ="));
		Элементы.ГодКорректировки.СписокВыбора.Очистить();
		Для Каждого ЭлементСписка Из СписокГодов Цикл
			Элементы.ГодКорректировки.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	Иначе
		ГодКорректировки = Объект.ДатаНачалаЛимита;
		Элементы.ГодКорректировки.КнопкаВыпадающегоСписка = Ложь;
	КонецЕсли;
	
	Объект.ПланРемонтовКорректировка.Сортировать("Удалить Возр,СпособВыполнения Убыв, РентабельностьРемонта Возр,СуммаРемонта Убыв, ОбъектРемонтныхРабот Возр, ВидРемонтныхРабот Возр, ДатаНач Возр");
	
	ЗаполнитьСпискиДоступныхОтборов();
	
	ПересчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СписокОрганизаций.Количество() = 1 Тогда
		ОтборОрганизация = СписокОрганизаций[0].Значение;
		ОтборОрганизацияПриИзменении(ОтборОрганизация);
	КонецЕсли;
	
	УстановитьОтборСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ВремМассив = ТаблицаНаправлений.НайтиСтроки(Новый Структура("Организация", ОтборОрганизация));
	
	Если ВремМассив.Количество() > 0 Тогда
		ИскомоеНаправление = ВремМассив[0].Направление;
		ОтборНаправление = ИскомоеНаправление;
		ОтборНаправлениеПриИзменении(ОтборНаправление);
	Иначе
		УстановитьОтборСписка();
		ПересчитатьСумму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЕстьОрганизации = Ложь;
	Для каждого Строка из СписокОрганизаций Цикл
		Если ЗначениеЗаполнено(Строка.Значение) Тогда
			ЕстьОрганизации = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОрганизации Тогда
		СтруктураОтбора = Новый Структура("Ссылка", СписокОрганизаций);
		ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбора);
		ОткрытьФорму("Справочник.Организации.ФормаВыбора", ПараметрыФормы, Элемент, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаправлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	СписокНаправлений = Новый СписокЗначений;
	ЕстьНаправления = Ложь;
	Для каждого Строка из ТаблицаНаправлений Цикл
		Если ЗначениеЗаполнено(Строка.Направление) Тогда
			Если ОтборОрганизация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка") ИЛИ Строка.Организация = ОтборОрганизация Тогда
				СписокНаправлений.Добавить(Строка.Направление);
			КонецЕсли; 
			ЕстьНаправления = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьНаправления Тогда
		СтруктураОтбора = Новый Структура("Ссылка", СписокНаправлений);
		ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбора);		
		ОткрытьФорму("Справочник.торо_НаправленияОбъектовРемонтныхРабот.ФормаВыбора",ПараметрыФормы,Элемент, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	
	УстановитьОтборСписка();
	ПересчитатьСумму();

КонецПроцедуры

&НаКлиенте
Процедура ГодКорректировкиПриИзменении(Элемент)
	
	Попытка 
		ГодКорректировки = Число(ГодКорректировки);
	Исключение
	КонецПопытки;
	
	УстановитьОтборСписка();
	ПересчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура ГодКорректировкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		ГодКорректировки = ВыбранноеЗначение;
		
		СтруктураОтбора = Новый Структура(Элементы.ПланРемонтовКорректировка.ОтборСтрок);
		Если СтруктураОтбора.Свойство("Год") Тогда
			СтруктураОтбора.Удалить("Год");
		КонецЕсли;
		Элементы.ПланРемонтовКорректировка.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
		
		ПересчитатьСумму();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланРемонтовКорректировка
&НаКлиенте
Процедура ПланРемонтовКорректировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовКорректировкаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовКорректировкаУдалитьПриИзменении(Элемент)
	ТекДанные = Элементы.ПланРемонтовКорректировка.ТекущиеДанные;
	
	СуммаОстаток = СуммаОстаток + ?(ТекДанные.Удалить,-1,1) * ТекДанные.СуммаРемонта;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Перенести данные по ремонтам в документ ППР?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для каждого ТекСтрока из Объект.ПланРемонтовКорректировка Цикл
		ТекСтрока.Удалить = Истина;
	КонецЦикла;
	ПересчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого ТекСтрока из Объект.ПланРемонтовКорректировка Цикл
		ТекСтрока.Удалить = Ложь;
	КонецЦикла;
	ПересчитатьСумму();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьСумму()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(торо_ПлановыеРемонтныеРаботыСрезПоследних.СтоимостьРемонта) КАК СтоимостьРемонта
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			НЕ ID В (&СписокID)
	|				И ВЫБОР
	|					КОГДА &Филиал = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ОбъектРемонтныхРабот.Организация = &Филиал
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Направление = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ОбъектРемонтныхРабот.Направление = &Направление
	|				КОНЕЦ) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен = ЛОЖЬ
	|	И торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен = ЛОЖЬ
	|	И ГОД(торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот) >= &ГодНач
	|	И ГОД(торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот) <= &ГодКон";
	
	Запрос.УстановитьПараметр("ГодНач", ?(ТипЗнч(ГодКорректировки) = Тип("Строка"), Объект.ДатаНачалаЛимита, ГодКорректировки));
	Запрос.УстановитьПараметр("ГодКон", ?(ТипЗнч(ГодКорректировки) = Тип("Строка"), Объект.ДатаОкончанияЛимита, ГодКорректировки));
	Запрос.УстановитьПараметр("Направление", ?(ТипЗнч(ОтборНаправление) <> Тип("Строка") И ЗначениеЗаполнено(ОтборНаправление), ОтборНаправление, Неопределено));
	Запрос.УстановитьПараметр("Филиал", ?(ТипЗнч(ОтборОрганизация) <> Тип("Строка") И ЗначениеЗаполнено(ОтборОрганизация), ОтборОрганизация, Неопределено));
	
	СтруктураПоиска = Новый Структура;
	Если ТипЗнч(ОтборОрганизация) <> Тип("Строка") И ЗначениеЗаполнено(ОтборОрганизация) Тогда
		СтруктураПоиска.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	Если ТипЗнч(ОтборНаправление) <> Тип("Строка") И ЗначениеЗаполнено(ОтборНаправление) Тогда
		СтруктураПоиска.Вставить("Направление", ОтборНаправление);
	КонецЕсли;
	
	Если ТипЗнч(ГодКорректировки) <> Тип("Строка") Тогда
		СтруктураПоиска.Вставить("Год", ГодКорректировки);
	КонецЕсли;

	ВремТаб = Объект.ПланРемонтовКорректировка.Выгрузить(СтруктураПоиска);
	
	Запрос.УстановитьПараметр("СписокID",ВремТаб.ВыгрузитьКолонку("ID"));
	
	СтруктураПоиска.Вставить("Удалить",Ложь);
	СтруктураПоиска.Вставить("Отменен",Ложь);
	СтруктураПоиска.Вставить("Замещен",Ложь);
	ВремТаб = Объект.ПланРемонтовКорректировка.Выгрузить(СтруктураПоиска);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И Выборка.СтоимостьРемонта <> Null Тогда
		СуммаОстаток = Выборка.СтоимостьРемонта;
	Иначе
		СуммаОстаток = 0;
	КонецЕсли;
	
	СуммаОстаток = СуммаОстаток + ВремТаб.Итог("СуммаРемонта");
	
	ПолучитьСуммуЛимита();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСуммуЛимита()
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних.Лимит) КАК Лимит,
	|	торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних.СпособВыполнения КАК СпособВыполнения
	|ИЗ
	|	РегистрСведений.торо_ГодовыеЛимитыРемонтныхРабот.СрезПоследних(
	|			,
	|			ВЫБОР
	|					КОГДА &Направление = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Направление = &Направление
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Филиал = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Организация = &Филиал
	|				КОНЕЦ
	|				И ГОД(Период) >= &ГодНач
	|				И ГОД(Период) <= &ГодКон) КАК торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних.СпособВыполнения";
	
	Запрос.УстановитьПараметр("ГодНач", ?(ТипЗнч(ГодКорректировки) = Тип("Строка"), Объект.ДатаНачалаЛимита, ГодКорректировки));
	Запрос.УстановитьПараметр("ГодКон", ?(ТипЗнч(ГодКорректировки) = Тип("Строка"), Объект.ДатаОкончанияЛимита, ГодКорректировки));
	Запрос.УстановитьПараметр("Направление", ?(ТипЗнч(ОтборНаправление) <> Тип("Строка") И ЗначениеЗаполнено(ОтборНаправление), ОтборНаправление, Неопределено));
	Запрос.УстановитьПараметр("Филиал", ?(ТипЗнч(ОтборОрганизация) <> Тип("Строка") И ЗначениеЗаполнено(ОтборОрганизация), ОтборОрганизация, Неопределено));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаЛимитПодрядный = 0;
	СуммаЛимитХозспособ = 0;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СпособВыполнения = Перечисления.СпособыСтроительства.Подрядный Тогда
			СуммаЛимитПодрядный = Выборка.Лимит;
		Иначе
			СуммаЛимитХозспособ = Выборка.Лимит;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиДоступныхОтборов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних.Организация КАК Организация,
	|	торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних.Направление КАК Направление
	|ИЗ
	|	РегистрСведений.торо_ГодовыеЛимитыРемонтныхРабот.СрезПоследних(
	|			,
	|			ГОД(Период) >= &ГодНач
	|				И ГОД(Период) <= &ГодКон) КАК торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних";
	
	Запрос.УстановитьПараметр("ГодНач", Объект.ДатаНачалаЛимита);
	Запрос.УстановитьПараметр("ГодКон", Объект.ДатаОкончанияЛимита);
	
	Таб = Запрос.Выполнить().Выгрузить();
	Таб.Свернуть("Организация,Направление");
	ТаблицаНаправлений.Загрузить(Таб);
	
	ТабОрг = Таб.Скопировать(,"Организация");
	ТабОрг.Свернуть("Организация");
	
	СписокОрганизаций.ЗагрузитьЗначения(ТабОрг.ВыгрузитьКолонку("Организация"));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОценкиРМ()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таб.ID,
	|	Таб.ВидРемонтныхРабот,
	|	Таб.ОбъектРемонтныхРабот,
	|	Таб.датаНач,
	|	Таб.датаКон,
	|	Таб.СпособВыполнения,
	|	Таб.Исполнитель,
	|	Таб.СуммаРемонта,
	|	Таб.Отменен,
	|	Таб.Удалить,
	|	Таб.ГраничныйРемонт,
	|	Таб.Замещен
	|ПОМЕСТИТЬ ИсходнаяТаб
	|ИЗ
	|	&Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходнаяТаб.ID,
	|	ИсходнаяТаб.ВидРемонтныхРабот,
	|	ИсходнаяТаб.ОбъектРемонтныхРабот,
	|	ИсходнаяТаб.датаНач,
	|	ИсходнаяТаб.датаКон,
	|	ИсходнаяТаб.СпособВыполнения,
	|	ИсходнаяТаб.Исполнитель,
	|	ИсходнаяТаб.СуммаРемонта,
	|	ИсходнаяТаб.Отменен,
	|	ИсходнаяТаб.ГраничныйРемонт,
	|	ИсходнаяТаб.Замещен,
	|	торо_ОценкаРМПлановыхРемонтов.ВероятностьВыходаИзСтроя,
	|	торо_ОценкаРМПлановыхРемонтов.Ущерб,
	|	торо_ОбъектыРемонта.Родитель,
	|	торо_ОбъектыРемонта.Организация,
	|	торо_ОбъектыРемонта.Направление,
	|	ВЫБОР
	|		КОГДА ИсходнаяТаб.СуммаРемонта = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(торо_ОценкаРМПлановыхРемонтов.ВероятностьВыходаИзСтроя, 0) / 100 * ЕСТЬNULL(торо_ОценкаРМПлановыхРемонтов.Ущерб, 0) / ИсходнаяТаб.СуммаРемонта
	|	КОНЕЦ КАК РентабельностьРемонта,
	|	ВЫБОР
	|		КОГДА ИсходнаяТаб.СуммаРемонта = 0
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(торо_ОценкаРМПлановыхРемонтов.ВероятностьВыходаИзСтроя, 0) / 100 * ЕСТЬNULL(торо_ОценкаРМПлановыхРемонтов.Ущерб, 0) = 0
	|			ТОГДА ИСТИНА
	|		КОГДА ИсходнаяТаб.Отменен
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Удалить,
	|	ГОД(ИсходнаяТаб.датаНач) КАК Год
	|ИЗ
	|	ИсходнаяТаб КАК ИсходнаяТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОценкаРМПлановыхРемонтов КАК торо_ОценкаРМПлановыхРемонтов
	|		ПО (торо_ОценкаРМПлановыхРемонтов.ID = ИсходнаяТаб.ID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО (торо_ОбъектыРемонта.Ссылка = ИсходнаяТаб.ОбъектРемонтныхРабот)";
	Запрос.УстановитьПараметр("Таб", Объект.ПланРемонтовКорректировка.Выгрузить());
	
	Объект.ПланРемонтовКорректировка.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
    КонецЕсли;
	
	ВыбратьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФрагмент()
    МассивПередачи = Новый Массив;
	Для каждого СтрокаТЧ Из Объект.ПланРемонтовКорректировка Цикл
		СтруктураДанных = Новый Структура("ID, Отменен", СтрокаТЧ.ID, СтрокаТЧ.Удалить);
        МассивПередачи.Добавить(СтруктураДанных);
    КонецЦикла;
    
    Оповестить("КорректировкаППРПоЛимитам", МассивПередачи);
    Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСписка()
	
	СтруктураОтбора = Новый Структура;
	Если ЗначениеЗаполнено(ГодКорректировки) Тогда
		СтруктураОтбора.Вставить("Год", ГодКорректировки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборНаправление) И ТипЗнч(ОтборНаправление) <> Тип("Строка") Тогда
		СтруктураОтбора.Вставить("Направление", ОтборНаправление);
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборОрганизация) И ТипЗнч(ОтборОрганизация) <> Тип("Строка") Тогда
		СтруктураОтбора.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	
	Элементы.ПланРемонтовКорректировка.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если НЕ ТипЗнч(ОтборОрганизация) = Тип("Строка") Тогда
		ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОрганизаций);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если НЕ ТипЗнч(ОтборОрганизация) = Тип("Строка") Тогда
		ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОрганизаций);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаправлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если НЕ ТипЗнч(ОтборНаправление) = Тип("Строка") Тогда
		СписокОтбора = Новый СписокЗначений;
		Для каждого Строка из ТаблицаНаправлений Цикл
			Если ЗначениеЗаполнено(Строка.Направление) Тогда
				Если ОтборОрганизация = "<По всем организациям>" ИЛИ Строка.Организация = ОтборОрганизация Тогда
					СписокОтбора.Добавить(Строка.Направление);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;		
		ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаправлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если НЕ ТипЗнч(ОтборНаправление) = Тип("Строка") Тогда
		СписокОтбора = Новый СписокЗначений;
		Для каждого Строка из ТаблицаНаправлений Цикл
			Если ЗначениеЗаполнено(Строка.Направление) Тогда
				Если ОтборОрганизация = "<По всем организациям>" ИЛИ Строка.Организация = ОтборОрганизация Тогда
					СписокОтбора.Добавить(Строка.Направление);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
